{
	"navbar": {
		"skills": "Skills",
		"projects": "Projects",
		"experience": "Experiences",
		"school": "School",
		"contact": "Contact",
		"learnings": "My learnings",
		"hobbies": "My hobbies"
	},
	"introductionSection": {
		"welcome": "Hi, I'm Steven Tea!",
		"profession": "Cloud & Software engineer",
		"description": "Passionate about creation and innovation, I enjoy experimenting, building and finding original solutions for technical challenges."
	},
	"skillsSection": {
		"subheader": "My mains skills",
		"backend": {
			"title": "Backend",
			"description": "API conception and implementation of the business logic.",
			"tags": [
				"Node.JS",
				"Java",
				"Go",
				"Express",
				"SAP CAP (CDS)",
				"Python",
				"SpringBoot",
				"Redis"
			]
		},
		"frontend": {
			"title": "Frontend",
			"description": "Development of reactive and fluide web interfaces with a focus on accessibility and polished UX.",
			"tags": [
				"React",
				"TypeScript",
				"Tailwind CSS",
				"SAPUI5",
				"HTML",
				"CSS",
				"Vue.JS"
			]
		},
		"architecture": {
			"title": "Application architecture",
			"description": "Conception of the architecture, components and data flows to ensure maintenability, performance and scalability.",
			"tags": ["UML Diagram", "Object oriented programming"]
		},
		"cloud": {
			"title": "Cloud",
			"description": "Deploying and orchestrating applications in the cloud.",
			"tags": ["SAP BTP"]
		}
	},
	"projectsSection": {
		"subheader": "Here's my recent projects!",
		"blackfridaySimulator": {
			"title": "Black Friday simulation",
			"description": "A Go-based simulation designed to model crowd dynamics during Black Friday, with the goal of identifying an optimal store layout that allows agents to navigate the entire store efficiently.\n\nThe system includes several types of agents: standard customers, selfish customers capable of stealing from other agents, and security guards responsible for reducing theft within their field of view.",
			"tags": ["Multi-agents System", "Go / Ebiten", "Concurrency management"]
		},
		"bobby": {
			"title": "Bobby: Inventory management for UTC Student Organizations",
			"description": "Bobby is a web application in Laravel and React to manage UTC student organizations' equipments. This application allows student organizations to display their inventory and create borrow requests from other associations.",
			"tags": ["PHP / Laravel", "React / Typescript"]
		},
		"kanamaster": {
			"title": "KanaMaster: Mobile application quiz",
			"description": "KanaMaster is a Java-based mobile quiz application designed to help users learn the main Japanese characters known as kana.",
			"tags": ["Java", "Android Studio"]
		}
	},
	"experienceSection": {
		"subheader": "My professional experiences",
		"apprenticeshipSAP": {
			"from": "September 2024",
			"to": "Now",
			"title": "Cloud & Software Engineer Apprentice",
			"company": "SAP France",
			"description": "Design and Full-Stack development of a cloud platform on SAP BTP enabling access and permission management for Azure and SAP HANA datalakes, providing AI teams with secure data environments, with a SAP CAP/CDS backend and React interfaces built with UI5 Web Components.",
			"tags": [
				"SAP BTP",
				"Full-Stack",
				"SAP CAP (CDS)",
				"SpringBoot",
				"React",
				"UI5"
			]
		},
		"internshipIZHO": {
			"from": "April 2024",
			"to": "August 2024",
			"title": "Developer Cloud Full-Stack Intern",
			"company": "IZHO",
			"description": "Development and optimization of Capcore, a web platform for energy consumption data management. Implemented multi-format data importers, built automated export pipelines, generated dynamic reporting features, and refactored backend components within an AWS-based microservices architecture.",
			"tags": [
				"AWS",
				"Serverless",
				"Microservices",
				"Node.js",
				"TypeScript",
				"Chart.js"
			]
		},
		"internshipSIMPLOS": {
			"from": "April 2023",
			"to": "June 2023",
			"title": "Developer Web & Mobile Intern",
			"company": "SIMPLOS",
			"description": "Design and implementation of a WordPress plugin connecting e-commerce websites to the SIMPLOS platform to externalize customer authentication and data storage, with secure retrieval of required information for user registration and product purchases.",
			"tags": ["Cybersecurity", "Mobile", "Flutter", "WordPress", "PHP"]
		}
	},
	"schoolSection": {
		"subheader": "My academic background and certifications!",
		"utc": {
			"from": "2024",
			"to": "Now",
			"title": "Master's Degree in Computer Engineering — Infrastructure and Information Systems",
			"school": "Université de Technologie de Compiègne",
			"description": "Engineering program in Computer Science, specializing in infrastructure and information systems. Covered distributed architectures, cloud computing, and the design of maintainable systems. Developed a particular interest in AI (multi-agent systems)."
		},
		"iut": {
			"from": "2021",
			"to": "2024",
			"title": "Bachelor of Technology in Computer Science — Design, Development, and Testing",
			"school": "University Institute of Technology, Paris Cité (IUT Paris Cité)",
			"description": "Program in Computer Science emphasizing the design and development of maintainable applications. Worked on web and mobile projects and designed application architectures. Validated applications through unit and integration testing. Gained hands-on experience throughout the software development lifecycle."
		},
		"bac": {
			"from": "2018",
			"to": "2021",
			"title": "French Baccalaureate — Major in Computer Science and Mathematics",
			"school": "Rosa Parks High School",
			"description": "Early experience in software development and algorithms. Created simple Python applications and web applications with HTML/CSS/JS. Worked with relational databases and learned fundamental data structures."
		}
	},
	"contactSection": {
		"subheader": "Let's connect!",
		"contacts": {
			"github": "My future projects",
			"linkedin": "My next experiences",
			"email": "Let's discuss!"
		}
	},
	"aboutMeSection": {
		"welcome": "More about me?",
		"description": "I enjoy discovering new technologies, experimenting with ideas, and building projects just for the fun of learning and creating something cool along the way!"
	},
	"learningsSection": {
		"subheader": "To satisfy my curiosity!",
		"learning1": {
			"title": "AWS Certified Cloud Practitioner",
			"description": "I am currently taking AWS Certified Cloud Practitioner courses (CLF-C02) to learn and understand the best practices and cost optimization strategies for AWS cloud architectures.",
			"tags": [
				"AWS",
				"Cloud",
				"Cloud fundamentals",
				"Cloud computing",
				"Cost optimization"
			]
		},
		"learning2": {
			"title": "Reinforcement Learning",
			"description": "I am learning reinforcement learning through David Silver's course to understand how to design agents capable of making optimal decisions, with the goal of developing an intelligent multi-agent system for package delivery.",
			"tags": [
				"Distributed systems",
				"Machine Learning",
				"Decision-making agents",
				"Multi-agent Systems"
			]
		},
		"learning3": {
			"title": "Japanese language",
			"description": "I am currently learning Japanese at Université de technologie de Compiègne (UTC) as well as independently to improve my language skills and deepen my understanding of Japanese culture, with the goal of reaching an A2 level.",
			"tags": ["Language", "Japanese", "Communication"]
		}
	},
	"hobbiesSection": {
		"subheader": "What I like to do!"
	},
	"buttons": {
		"github": "View on Github"
	}
}
